extension/test/fixtures/payment-credit-card-3d.json

{
  "amountPlanned": {
    "type": "centPrecision",
    "currencyCode": "EUR",
    "centAmount": 795,
    "fractionDigits": 2
  },
  "paymentMethodInfo": {
    "paymentInterface": "ctp-adyen-integration",
    "method": "creditCard_3d"
  },
  "custom": {
    "type": {
      "typeId": "type",
      "key": "ctp-adyen-integration-payment-custom-type"
    },
    "fields": {
      "merchantReference": "paymentReferenceId",
      "countryCode": "DE",
      "encryptedCardNumber":"${encryptedCardNumber}",
      "encryptedExpiryMonth":"${encryptedExpiryMonth}",
      "encryptedExpiryYear":"${encryptedExpiryYear}",
      "encryptedSecurityCode":"${encryptedSecurityCode}",
      "returnUrl":"${returnUrl}",
      "holderName": "John Smith",
      "browserInfo": "{\"userAgent\":\"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36\",\"acceptHeader\":\"text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8\"}"
    }
  },
  "paymentStatus": {},
  "transactions": [
    {
      "type": "Authorization",
      "amount": {
        "type": "centPrecision",
        "currencyCode": "EUR",
        "centAmount": 495,
        "fractionDigits": 2
      },
      "state": "Initial"
    }
  ],
  "interfaceInteractions": [
  ]
}
